---
title: SpanDirectionSymbol
classe: Autodesk.Revit.DB.SpanDirectionSymbol
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.IndependentTag
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# SpanDirectionSymbol

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `SpanDirectionSymbol Create(Document, ElementId, LinkElementId, XYZ, ElementId)` | `SpanDirectionSymbol.Create(document, viewId, elemIdToTag, headPosistion, symbolId)` | SpanDirectionSymbol |
| `XYZ GetDefaultPlacementPoint(Document, LinkElementId)` | `SpanDirectionSymbol.GetDefaultPlacementPoint(document, elemIdToTag)` | XYZ |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```